### Pandas-DataFrame And Series
**DataFrame** is a 2-dimensional labeled data structure with columns of potentially different types, similar to a spreadsheet or SQL table.

**Series** is a 1-dimensional labeled array capable of holding any data type, essentially a single column of a DataFrame.

In [1]:
import pandas as pd

In [2]:
# Series example
series_data = pd.Series([1, 2, 3, 4, 5], name='Numbers')
print("Series:")
print(series_data)

Series:
0    1
1    2
2    3
3    4
4    5
Name: Numbers, dtype: int64

In [3]:
# Create Series with dictionary
series_dict = pd.Series({'a': 1, 'b': 2, 'c': 3}, name='Letters')
print("Series from dictionary:")
print(series_dict)

Series from dictionary:
a    1
b    2
c    3
Name: Letters, dtype: int64

In [4]:
# Create a Series with custom index
custom_index_series = pd.Series([10, 20, 30], index=['x', 'y', 'z'], name='CustomIndex')
print("Series with custom index:")
print(custom_index_series)

Series with custom index:
x    10
y    20
z    30
Name: CustomIndex, dtype: int64

In [12]:
## DataFrame example
## Create a DataFrame from a dictionary of lists
data = {
    'Name': ['Muzmmil', 'Jiya', 'Najmin'],
    'Age': [25, 30, 35],
    'City': ['Latur', 'Mumbai', 'Pune']
}
df = pd.DataFrame(data)
print("DataFrame from dictionary:")
print(df)

DataFrame from dictionary:
      Name  Age    City
0  Muzmmil   25   Latur
1     Jiya   30  Mumbai
2   Najmin   35    Pune

In [13]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [14]:
## create a DataFrame From a list of dictionaries
data_list = [
    {'Name': 'Muzmmil', 'Age': 25, 'City': 'Latur'},
    {'Name': 'Jiya', 'Age': 30, 'City': 'Mumbai'},
    {'Name': 'Najmin', 'Age': 35, 'City': 'Pune'}
]
df_from_list = pd.DataFrame(data_list)
print("DataFrame from list of dictionaries:")
print(df_from_list)

DataFrame from list of dictionaries:
      Name  Age    City
0  Muzmmil   25   Latur
1     Jiya   30  Mumbai
2   Najmin   35    Pune

In [16]:
sales_df = pd.read_csv('sales.csv')
print("Sales DataFrame:")
sales_df.head()

Sales DataFrame:

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Middle East and North Africa,Libya,Cosmetics,Offline,M,10/18/2014,686800706,10/31/2014,8446,437.20,263.33,3692591.20,2224085.18,1468506.02
1,North America,Canada,Vegetables,Online,M,11/7/2011,185941302,12/8/2011,3018,154.06,90.93,464953.08,274426.74,190526.34
2,Middle East and North Africa,Libya,Baby Food,Offline,C,10/31/2016,246222341,12/9/2016,1517,255.28,159.42,387259.76,241840.14,145419.62
3,Asia,Japan,Cereal,Offline,C,4/10/2010,161442649,5/12/2010,3322,205.70,117.11,683335.40,389039.42,294295.98
4,Sub-Saharan Africa,Chad,Fruits,Offline,H,8/16/2011,645713555,8/31/2011,9845,9.33,6.92,91853.85,68127.40,23726.45

In [17]:
sales_df.tail()  # Display the last few rows of the DataFrame

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
995,Middle East and North Africa,Azerbaijan,Snacks,Offline,C,4/18/2010,534085166,4/25/2010,6524,152.58,97.44,995431.92,635698.56,359733.36
996,Europe,Georgia,Baby Food,Offline,H,8/1/2011,590768182,9/7/2011,288,255.28,159.42,73520.64,45912.96,27607.68
997,Middle East and North Africa,United Arab Emirates,Vegetables,Online,C,5/12/2011,524363124,6/28/2011,9556,154.06,90.93,1472197.36,868927.08,603270.28
998,Europe,Finland,Household,Offline,L,1/25/2016,289606320,2/14/2016,9801,668.27,502.54,6549714.27,4925394.54,1624319.73
999,Europe,Portugal,Cereal,Offline,C,4/10/2014,811546599,5/8/2014,3528,205.70,117.11,725709.60,413164.08,312545.52

In [18]:
df

      Name  Age    City
0  Muzmmil   25   Latur
1     Jiya   30  Mumbai
2   Najmin   35    Pune

In [19]:
df['Name']  # Access a specific column

0    Muzmmil
1       Jiya
2     Najmin
Name: Name, dtype: object

In [20]:
type(df['Name'])  # Check the type of the column

pandas.core.series.Series

In [21]:
df.loc[0]  # Access the first row using label-based indexing

Name    Muzmmil
Age          25
City      Latur
Name: 0, dtype: object

In [22]:
df.iloc[0]  # Access the first row using integer-location based indexing

Name    Muzmmil
Age          25
City      Latur
Name: 0, dtype: object

In [23]:
df.iloc[0]['Name']  # Access the 'Name' column of the first row

'Muzmmil'

In [24]:
df.iloc[0][0]

/var/folders/n9/mtkrzfbj5cnfxtx75vygp7kc0000gr/T/ipykernel_93203/2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Muzmmil'

In [25]:
## Accessing specific rows and columns
# Access the first row and the 'Name' column
first_row_name = df.iloc[0]['Name']
print("First row 'Name' column value:", first_row_name)
# Access the first row and the first column
first_row_first_col = df.iloc[0][0]
print("First row first column value:", first_row_first_col)

First row 'Name' column value: Muzmmil
First row first column value: Muzmmil

/var/folders/n9/mtkrzfbj5cnfxtx75vygp7kc0000gr/T/ipykernel_93203/1997770254.py:6: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  first_row_first_col = df.iloc[0][0]

In [26]:
df.at[0, 'Name']  # Access the 'Name' column of the first row using .at

'Muzmmil'

In [27]:
# Accessing specific rows and columns using .iat
first_row_name_iat = df.iat[0, 0]
print("First row 'Name' column value using .iat:", first_row_name_iat)

First row 'Name' column value using .iat: Muzmmil

In [28]:
## Data Manipulation with DataFrames
# Adding a new column
df['Salary'] = [50000, 60000, 70000]
print("DataFrame after adding 'Salary' column:")
print(df)

DataFrame after adding 'Salary' column:
      Name  Age    City  Salary
0  Muzmmil   25   Latur   50000
1     Jiya   30  Mumbai   60000
2   Najmin   35    Pune   70000

In [29]:
# Removing a column
df.drop('Salary', axis=1, inplace=True)
print("DataFrame after removing 'Salary' column:")
print(df)

DataFrame after removing 'Salary' column:
      Name  Age    City
0  Muzmmil   25   Latur
1     Jiya   30  Mumbai
2   Najmin   35    Pune

In [30]:
df['Age'] = df['Age'] + 5  # Increment 'Age' by 5

In [31]:
df

      Name  Age    City
0  Muzmmil   30   Latur
1     Jiya   35  Mumbai
2   Najmin   40    Pune

In [32]:
# Display the DataFrame
sales_df.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Middle East and North Africa,Libya,Cosmetics,Offline,M,10/18/2014,686800706,10/31/2014,8446,437.20,263.33,3692591.20,2224085.18,1468506.02
1,North America,Canada,Vegetables,Online,M,11/7/2011,185941302,12/8/2011,3018,154.06,90.93,464953.08,274426.74,190526.34
2,Middle East and North Africa,Libya,Baby Food,Offline,C,10/31/2016,246222341,12/9/2016,1517,255.28,159.42,387259.76,241840.14,145419.62
3,Asia,Japan,Cereal,Offline,C,4/10/2010,161442649,5/12/2010,3322,205.70,117.11,683335.40,389039.42,294295.98
4,Sub-Saharan Africa,Chad,Fruits,Offline,H,8/16/2011,645713555,8/31/2011,9845,9.33,6.92,91853.85,68127.40,23726.45

In [33]:
sales_df.describe()  # Get summary statistics of the DataFrame

,Order ID,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
count,1.000000e+03,1000.000000,1000.00000,1000.000000,1.000000e+03,1.000000e+03,1.000000e+03
mean,5.496813e+08,5053.988000,262.10684,184.965110,1.327322e+06,9.361192e+05,3.912026e+05
std,2.571334e+08,2901.375317,216.02106,175.289311,1.486515e+06,1.162571e+06,3.836402e+05
min,1.029280e+08,13.000000,9.33000,6.920000,2.043250e+03,1.416750e+03,5.326100e+02
25%,3.280740e+08,2420.250000,81.73000,56.670000,2.811919e+05,1.649319e+05,9.837612e+04
50%,5.566097e+08,5184.000000,154.06000,97.440000,7.549392e+05,4.647261e+05,2.772260e+05
75%,7.696945e+08,7536.750000,421.89000,263.330000,1.733503e+06,1.141750e+06,5.484568e+05
max,9.955298e+08,9998.000000,668.27000,524.960000,6.617210e+06,5.204978e+06,1.726181e+06